
-----------------------------------------------------------------------------------
insert into airports( airport_code, airport_name, city )
    values ('KZN','Казань','Казань')               ,
           ('OVB','Толмачёво','Новосибирск')       ,
           ('KRR','Пашковский','Краснодар')        ,
           ('NUX','Новый Уренгой','Новый Уренгой') ,
           ('SVX','Кольцово','Екатеринбург')       ,
           ('AER','Сочи','Сочи')                   ;
-----------------------------------------------------------------------------------

-----------------------------------------------------------------------------------
insert into flights( flight_no, airline_name, scheduled_departure, departure_airport, 
                                                arrival_airport, status, aircraft_code )
    values ('BA 8780','British Airways','2020-10-10 09:40:00','KZN','DME','Arrived','737') ,
           ('A3 3535','Aegean Airlines','2020-10-10 10:05:00','OVB','DME','Arrived','773') ,
           ('S7 2072','S7 Airlines','2020-10-10 17:05:00','KRR','DME','Cancelled','32S')   ,
           ('IO 242','Iraero','2020-10-10 18:10:00','NUX','DME','Cancelled','340')         ,
           ('9U 9176','Air Moldova','2020-10-10 18:25:00','SVX','DME','Cancelled','32S')   ,
           ('5N 244','Smartavia','2020-10-10 19:50:00','AER','DME','Cancelled','737')      ; 
-----------------------------------------------------------------------------------

-----------------------------------------------------------------------------------
insert into aircrafts( aircraft_code, model, range )
    values ('737','Boeing 737-700','5765')   ,
           ('773','Boeing 773-700','8765')   ,
           ('32S','Airbus A319-100','6845')  ,
           ('340','Airbus A340-500','16670') ;
-----------------------------------------------------------------------------------

-----------------------------------------------------------------------------------
insert into airline( airline_code, airline_name )
    values ('BA','British Airways' ) ,
           ('A3','Aegean Airlines' ) ,
           ('S7','S7 Airlines' )     ,
           ('IO','Iraero' )          ,
           ('9U','Air Moldova' )     ,
           ('5N','Smartavia' )       ;
-----------------------------------------------------------------------------------
